<a href="https://colab.research.google.com/github/constanza1993/coni-icaro/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
verduleria = {
  'manzanas': [3, 2, 0, 1], 
  'naranjas': [0, 3, 7, 2]
}

In [2]:
type (verduleria)

dict

In [11]:
import pandas as pd

In [14]:
nico = pd.DataFrame(verduleria)

In [15]:
nico

   manzanas  naranjas
0         3         0
1         2         3
2         0         7
3         1         2

In [16]:
nico = pd.DataFrame(verduleria, index=['Juan', 'Roberto', 'Liliana', 'David'])

In [17]:
nico

         manzanas  naranjas
Juan            3         0
Roberto         2         3
Liliana         0         7
David           1         2

In [18]:
type (nico)

pandas.core.frame.DataFrame

In [19]:
nico.loc['Roberto']

manzanas    2
naranjas    3
Name: Roberto, dtype: int64

In [20]:
df = pd.read_csv('https://raw.githubusercontent.com/nsoria1/icaro-datos-ejemplos/master/imdb_top_1000.csv')

In [21]:
df

                                           Poster_Link  ...        Gross
0    https://m.media-amazon.com/images/M/MV5BMDFkYT...  ...   28,341,469
1    https://m.media-amazon.com/images/M/MV5BM2MyNj...  ...  134,966,411
2    https://m.media-amazon.com/images/M/MV5BMTMxNT...  ...  534,858,444
3    https://m.media-amazon.com/images/M/MV5BMWMwMG...  ...   57,300,000
4    https://m.media-amazon.com/images/M/MV5BMWU4N2...  ...    4,360,000
..                                                 ...  ...          ...
995  https://m.media-amazon.com/images/M/MV5BNGEwMT...  ...          NaN
996  https://m.media-amazon.com/images/M/MV5BODk3Yj...  ...          NaN
997  https://m.media-amazon.com/images/M/MV5BM2U3Yz...  ...   30,500,000
998  https://m.media-amazon.com/images/M/MV5BZTBmMj...  ...          NaN
999  https://m.media-amazon.com/images/M/MV5BMTY5OD...  ...          NaN

[1000 rows x 16 columns]

In [23]:
df = pd.read_json('https://raw.githubusercontent.com/nsoria1/icaro-datos-ejemplos/master/iris_dataset.json')

In [24]:
df

     sepalLength  sepalWidth  petalLength  petalWidth    species
0            5.1         3.5          1.4         0.2     setosa
1            4.9         3.0          1.4         0.2     setosa
2            4.7         3.2          1.3         0.2     setosa
3            4.6         3.1          1.5         0.2     setosa
4            5.0         3.6          1.4         0.2     setosa
..           ...         ...          ...         ...        ...
145          6.7         3.0          5.2         2.3  virginica
146          6.3         2.5          5.0         1.9  virginica
147          6.5         3.0          5.2         2.0  virginica
148          6.2         3.4          5.4         2.3  virginica
149          5.9         3.0          5.1         1.8  virginica

[150 rows x 5 columns]

In [25]:
import requests

In [27]:
url = 'https://github.com/nsoria1/icaro-datos-ejemplos/blob/master/database.sqlite?raw=true'
r = requests.get(url, allow_redirects=True)
open('sqlite_ejemplo.db', 'wb').write(r.content)

5038080

In [29]:
!ls -ltr

total 4924
drwxr-xr-x 1 root root    4096 Feb 22 14:38 sample_data
-rw-r--r-- 1 root root 5038080 Feb 23 23:05 sqlite_ejemplo.db

In [30]:
import sqlite3

In [32]:
import sqlite3
con = sqlite3.connect("sqlite_ejemplo.db")

In [ ]:
df = pd.read_sql_query("select * from Tweets", con)

In [33]:
df

     sepalLength  sepalWidth  petalLength  petalWidth    species
0            5.1         3.5          1.4         0.2     setosa
1            4.9         3.0          1.4         0.2     setosa
2            4.7         3.2          1.3         0.2     setosa
3            4.6         3.1          1.5         0.2     setosa
4            5.0         3.6          1.4         0.2     setosa
..           ...         ...          ...         ...        ...
145          6.7         3.0          5.2         2.3  virginica
146          6.3         2.5          5.0         1.9  virginica
147          6.5         3.0          5.2         2.0  virginica
148          6.2         3.4          5.4         2.3  virginica
149          5.9         3.0          5.1         1.8  virginica

[150 rows x 5 columns]

In [34]:
df=pd.read_csv('https://raw.githubusercontent.com/nsoria1/icaro-datos-ejemplos/master/stock_data.csv')

In [35]:
df

         Dia  Precio Apertura  Precio Cierre   Resumen
0   1/1/2017             32.0           34.0  Ganancia
1   1/4/2017              NaN           32.0   Perdida
2   1/5/2017             28.0            NaN  Ganancia
3   1/6/2017              NaN           37.0       NaN
4   1/7/2017             32.0            NaN  Ganancia
5   1/8/2017              NaN            NaN   Perdida
6   1/9/2017              NaN            NaN       NaN
7  1/10/2017             34.0           36.0   Perdida
8  1/11/2017             40.0           34.0  Ganancia

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Dia              9 non-null      object
 1   Precio Apertura  5 non-null      float64
 2   Precio Cierre    5 non-null      float64
 3   Resumen          7 non-null      object
dtypes: float64(2), object(2)
memory usage: 416.0+ bytes

In [42]:
df2=pd.read_csv('https://raw.githubusercontent.com/nsoria1/icaro-datos-ejemplos/master/stock_data.csv', parse_dates=['Dia'],index_col=['Dia'])

In [43]:
df

         Dia  Precio Apertura  Precio Cierre   Resumen
0   1/1/2017             32.0           34.0  Ganancia
1   1/4/2017              NaN           32.0   Perdida
2   1/5/2017             28.0            NaN  Ganancia
3   1/6/2017              NaN           37.0       NaN
4   1/7/2017             32.0            NaN  Ganancia
5   1/8/2017              NaN            NaN   Perdida
6   1/9/2017              NaN            NaN       NaN
7  1/10/2017             34.0           36.0   Perdida
8  1/11/2017             40.0           34.0  Ganancia

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Dia              9 non-null      object
 1   Precio Apertura  5 non-null      float64
 2   Precio Cierre    5 non-null      float64
 3   Resumen          7 non-null      object
dtypes: float64(2), object(2)
memory usage: 416.0+ bytes

In [45]:
df_nuevo = df.fillna({'Precio Apertura' : 0.0, 'Precio Cierre' : 0.0, 'Resumen' : 'Sin Datos'})

In [46]:
df_nuevo

         Dia  Precio Apertura  Precio Cierre    Resumen
0   1/1/2017             32.0           34.0   Ganancia
1   1/4/2017              0.0           32.0    Perdida
2   1/5/2017             28.0            0.0   Ganancia
3   1/6/2017              0.0           37.0  Sin Datos
4   1/7/2017             32.0            0.0   Ganancia
5   1/8/2017              0.0            0.0    Perdida
6   1/9/2017              0.0            0.0  Sin Datos
7  1/10/2017             34.0           36.0    Perdida
8  1/11/2017             40.0           34.0   Ganancia

In [47]:
df_nuevo2 = df.fillna(method='ffill')

In [48]:
df_nuevo2

         Dia  Precio Apertura  Precio Cierre   Resumen
0   1/1/2017             32.0           34.0  Ganancia
1   1/4/2017             32.0           32.0   Perdida
2   1/5/2017             28.0           32.0  Ganancia
3   1/6/2017             28.0           37.0  Ganancia
4   1/7/2017             32.0           37.0  Ganancia
5   1/8/2017             32.0           37.0   Perdida
6   1/9/2017             32.0           37.0   Perdida
7  1/10/2017             34.0           36.0   Perdida
8  1/11/2017             40.0           34.0  Ganancia

In [49]:
dt = pd.date_range("01-01-2017", "01-11-2017")
dt

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
               '2017-01-05', '2017-01-06', '2017-01-07', '2017-01-08',
               '2017-01-09', '2017-01-10', '2017-01-11'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
idx = pd.DatetimeIndex(dt)

In [53]:
df_sql = df.append(df)
df_sql

         Dia  Precio Apertura  Precio Cierre   Resumen
0   1/1/2017             32.0           34.0  Ganancia
1   1/4/2017              NaN           32.0   Perdida
2   1/5/2017             28.0            NaN  Ganancia
3   1/6/2017              NaN           37.0       NaN
4   1/7/2017             32.0            NaN  Ganancia
5   1/8/2017              NaN            NaN   Perdida
6   1/9/2017              NaN            NaN       NaN
7  1/10/2017             34.0           36.0   Perdida
8  1/11/2017             40.0           34.0  Ganancia
0   1/1/2017             32.0           34.0  Ganancia
1   1/4/2017              NaN           32.0   Perdida
2   1/5/2017             28.0            NaN  Ganancia
3   1/6/2017              NaN           37.0       NaN
4   1/7/2017             32.0            NaN  Ganancia
5   1/8/2017              NaN            NaN   Perdida
6   1/9/2017              NaN            NaN       NaN
7  1/10/2017             34.0           36.0   Perdida
8  1/11/2017             40.0           34.0  Ganancia

In [55]:
df_sql.shape

(18, 4)

In [57]:
df_nuevo2.columns

Index(['Dia', 'Precio Apertura', 'Precio Cierre', 'Resumen'], dtype='object')

In [58]:
df_nuevo2.rename(columns={ 'Precio Apertura': 'Apertura',  'Precio Cierre': "Cierre"},  inplace=True)

In [59]:
df_nuevo2

         Dia  Apertura  Cierre   Resumen
0   1/1/2017      32.0    34.0  Ganancia
1   1/4/2017      32.0    32.0   Perdida
2   1/5/2017      28.0    32.0  Ganancia
3   1/6/2017      28.0    37.0  Ganancia
4   1/7/2017      32.0    37.0  Ganancia
5   1/8/2017      32.0    37.0   Perdida
6   1/9/2017      32.0    37.0   Perdida
7  1/10/2017      34.0    36.0   Perdida
8  1/11/2017      40.0    34.0  Ganancia

In [61]:

df_nuevo2.columns = [col.lower() for col in df_nuevo2]

In [62]:
df.isnull()

     Dia  Precio Apertura  Precio Cierre  Resumen
0  False            False          False    False
1  False             True          False    False
2  False            False           True    False
3  False             True          False     True
4  False            False           True    False
5  False             True           True    False
6  False             True           True     True
7  False            False          False    False
8  False            False          False    False